Repository: 84000/data-translation-memory
Catalog: Toh_96-The_Miraculous_Play_of_Manjusri-v2.tmx
Source language: bo
Languages: en

source: གང་གིས་དེ་རིང་འདུས་བྱས་རྣམས་ཀྱི་གཏིང་རྟོགས་སམ། །
en: Who has understood the depth of conditioned things today?

source: དེ་དག་ཉན་པར་འཚལ་གྱིས་ཐེ་ཙོམ་བསལ་དུ་གསོལ། །
en: We ask you to hear us. Please clear away our doubts.

source: འདྲེན་པ་འཛུམ་པ་མཛད་པའི་རྒྱུ་ནི་མཉན་སླད་དུ། །འགྲོ་བ་ཐམས་ཅད་ཐལ་མོ་སྦྱར་བ་བགྱིས་ཏེ་སྡོད། །
en: “The whole world praises you with palms joined together Because it wishes to hear why our leader has smiled.

source: རྐང་གཉིས་རྣམས་ཀྱི་གཙོ་བོ་ཐུགས་རྗེ་བསྐྱེད་མཛོད་ལ། །ཐེ་ཙོམ་གྱུར་པ་རྣམས་ཀྱི་ཡིད་གཉིས་བསལ་དུ་གསོལ། །
en: Best among all human beings, Please bring forth compassion and clear away the perplexity of doubt.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་ཞེས་བྱ་བ་འདི་མཐོང་ངམ།
en: “Ānanda, do you see this courtesan’s daughter, Suvarṇottama­prabhāśrī?” asked the Blessed One.

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །
en: “Yes, Blessed One, I see her,” Ānanda replied.

source: བདེ་བར་གཤེགས་པ་མཐོང་ལགས་སོ། །
en: “I see her, Sugata.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་འདི་ནི་སྔོན་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་སྟེ
en: “Ānanda,” said the Blessed One, “the princely Mañjuśrī has inspired this courtesan’s daughter, Suvarṇottama­prabhāśrī to fully embrace incomparable, perfect awakening.

source: འདིས་དེ་ལས་ཐོས་ནས་ཆོས་རྣམས་ལ་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: When she had heard about the Dharma from him, she developed the patient acceptance that is in accord with all things.”

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་འཇིགས་བྱིན་ཞེས་བྱ་བ་འདི་མཐོང་ངམ།
en: Then the Blessed One asked, “Ānanda, do you see this banker’s son Bhayadatta?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་འདི་ནི་ངས་སྔོན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་སྟེ
en: “Ānanda,” said the Blessed One, “I inspired this banker’s son Bhayadatta to fully embrace incomparable, perfect awakening.

source: འདིས་ཀྱང་ང་ལས་ཆོས་ཐོས་ནས་ཆོས་རྣམས་ལ་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: When he heard about the Dharma from me, he developed the patient acceptance that is in accord with all things.

source: ཀུན་དགའ་བོ་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་འདི་ནི་བསྐལ་པ་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་འདས་པའི་འོག་ཏུ་བསྐལ་པ་རིན་ཆེན་འབྱུང་བ་ཞེས་བྱ་བ་ལ། འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་ཅན་ཞེས་བྱ་བར་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ
en: Ānanda, nine million two hundred thousand eons from now, he will be called Ratnasaṃbhava, and this courtesan’s daughter Suvarṇottama­prabhāśrī will attain perfect awakening in a world sphere called Ratna.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་འོད་ཅེས་བྱ་བར་འགྱུར་རོ། །
en: She will be a tathāgata, a worthy one, a perfectly awakened one called Ratnaprabha.

source: ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་དེའི་སེམས་ཅན་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་། ཉེ་བར་སྤྱོད་པ་ནི་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ཅི་འདྲ་བ་དེ་འདྲ་བར་འགྱུར་རོ། །
en: Moreover, Ānanda, the pleasure and delight of the beings in that world sphere will be like that of the gods of the Heaven of the Thirty-Three.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེ་དག་མ་གཏོགས་པར་རིན་པོ་ཆེ་གཞན་འབྱུང་བར་མི་འགྱུར་རོ། །
en: The only jewels there will be bodhisatva jewels, and the lifespan of that tathāgata will be immeasurable.

source: དེ་བཞིན་གཤེགས་པ་དེའི་ཚེའི་ཚད་ནི་དཔག་ཏུ་མེད་པར་འགྱུར་རོ། །དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ན་ཚོང་དཔོན་གྱི་བུ་འཇིགས་བྱིན་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་རིན་ཆེན་འོད་ཅེས་བྱ་བར་གྱུར་ཏེ།
en: During the life of this perfectly awakened one, the banker’s son Bhayadatta will be born as a bodhisatva called Guṇaratnaprabha, and

source: དེ་བཞིན་གཤེགས་པ་དེའི་ཆོས་ཀྱི་མཛོད་འཛིན་པར་བྱེད་དོ། །
en: he will do the work of preserving the collected teachings of the Tathāgata.

source: གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་རིན་ཆེན་འོད་དེ་ལ། བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་རིན་ཆེན་འོད་འདི་ནི་ངའི་འོག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེདེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་འོད་འཕྲོ་ཞེས་བྱ་བར་འགྱུར་རོ། །
en: When the tathāgata Ratnaprabha reaches final nirvāṇa, he will pronounce the following prophecy for that bodhisatva Guṇaprabha: ‘This bodhisatva Guṇaprabha will reach complete awakening after me, and he will be a tathāgata, a worthy one, a perfectly awakened one called Ratnārcis.

source: དེའི་སངས་རྒྱས་ཀྱི་ཞིང་བཀོད་པ་ཡང་ངའི་ཅི་འདྲ་བ་དེ་འདྲ་བར་འགྱུར་རོ་ཞེས་ལུང་སྟོན་པར་འགྱུར་རོ། །
en: His buddhafield will resemble mine in appearance.’ ”

source: སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་དང་། ཚོང་དཔོན་གྱི་བུ་འཇིགས་བྱིན་གཉིས་ལུང་བསྟན་མ་ཐག་ཏུ་དེའི་མོད་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་ཤིང་འཇིག་རྟེན་དུ་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །
en: As soon as this prophecy had been spoken for the two of them, for the courtesan’s daughter Suvarṇottama­prabhāśrī and for the banker’s son Bhayadatta, the six forms of existence in this trichiliocosm were shaken, and all the worlds were illuminated by a great brightness.

source: ལུང་བསྟན་པ་བཤད་པ་འདི་བསྟན་པ་ན་སྲོག་ཆགས་བརྒྱ་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ། །
en: As that prophecy was set forth, a hundred thousand beings developed the mind set on the attainment of incomparable, perfect awakening.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then Venerable Ānanda asked the Blessed One,

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས།
en: “Blessed One, what is the name of this exposition of the Dharma?

source: འདི་ཇི་ལྟར་གཟུང་བར་བགྱི།
en: How should it be adopted?”

source: ཀུན་དགའ་བོ་དེའི་ཕྱིར་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཀོད་པ་ཆེན་པོའི་སྒོའི་ལེའུ་ཞེས་བྱ་བར་ཟུང་ཤིག །
en: “Ānanda, you should adopt this exposition of the Dharma as The Chapter on the Gate to the Great Presentation .

source: འཇམ་དཔལ་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: You should adopt it as The Miraculous Play of Mañjuśrī.

source: སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་བཏུལ་བ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: You should adopt it as The Education of the Courtesan’s Daughter Suvarṇottama­prabhāśrī .”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་དང་། ཚོང་དཔོན་གྱི་བུ་འཇིགས་བྱིན་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: When the Blessed One had uttered these words, Venerable Ānanda, the courtesan’s daughter Suvarṇottama­prabhāśrī, the banker’s son Bhayadatta, the princely Mañjuśrī, the bodhisatvas, those great beings and all their retinues, and the world with its gods, humans, demigods, and gandharvas were overjoyed and praised what the Blessed One had said.

source: རྒྱ་གར་གྱི་མཁན་པོ་སུ་རེན་དྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །།
en: This was edited and finalized by the Indian scholar Surendrabodhi, and by the chief editor and translator Venerable Yeshé Dé.
